'use strict';

module.exports.mockData = [
  {
    id: `uqL8xl`,
    title: `Как достигнуть успеха не вставая с кресла`,
    announce: `Рок-музыка всегда ассоциировалась с протестами. Так ли это на самом деле?`,
    fullText: `Этот смартфон — настоящая находка. Большой и яркий экран, мощнейший процессор — всё это в небольшом гаджете. Альбом стал настоящим открытием года. Мощные гитарные рифы и скоростные соло-партии не дадут заскучать. Это один из лучших рок-музыкантов. Из под его пера вышло 8 платиновых альбомов. Простые ежедневные упражнения помогут достичь успеха. Он написал больше 30 хитов. Помните, небольшое количество ежедневных упражнений лучше, чем один раз, но много. Игры и программирование разные вещи. Не стоит идти в программисты, если вам нравятся только игры. Достичь успеха помогут ежедневные повторения.`,
    createdDate: `2020-12-18T13:56:54.987Z`,
    category: [
      `Деревья`,
      `IT`,
      `Кино`,
      `Путешествия`,
      `За жизнь`,
      `Без рамки`,
      `Велоспорт`
    ],
    comments: [
      {
        id: `YPd-dj`,
        text: `Это где ж такие красоты? Давно не пользуюсь стационарными компьютерами. Ноутбуки победили. Совсем немного...`
      },
      {
        id: `Feh8Eg`,
        text: `Согласен с автором! Планируете записать видосик на эту тему? Плюсую, но слишком много буквы!`
      },
      {
        id: `U6Yej8`,
        text: `Мне кажется или я уже читал это где-то?`
      },
      {
        id: `tNQzCs`,
        text: `Хочу такую же футболку :-) Давно не пользуюсь стационарными компьютерами. Ноутбуки победили.`
      }
    ]
  },
  {
    id: `6398KG`,
    title: `Как достигнуть успеха не вставая с кресла`,
    announce: `Вы можете достичь всего. Стоит только немного постараться и запастись книгами. Процессор заслуживает особого внимания. Он обязательно понравится геймерам со стажем. Он написал больше 30 хитов.`,
    fullText: `Как начать действовать? Для начала просто соберитесь. Достичь успеха помогут ежедневные повторения. Это один из лучших рок-музыкантов. Вы можете достичь всего. Стоит только немного постараться и запастись книгами. Он написал больше 30 хитов. Игры и программирование разные вещи. Не стоит идти в программисты, если вам нравятся только игры. Рок-музыка всегда ассоциировалась с протестами. Так ли это на самом деле? Помните, небольшое количество ежедневных упражнений лучше, чем один раз, но много. Собрать камни бесконечности легко, если вы прирожденный герой. Простые ежедневные упражнения помогут достичь успеха. Золотое сечение — соотношение двух величин, гармоническая пропорция. Программировать не настолько сложно, как об этом говорят. Ёлки — это не просто красивое дерево. Это прочная древесина. Освоить вёрстку несложно. Возьмите книгу новую книгу и закрепите все упражнения на практике. Этот смартфон — настоящая находка. Большой и яркий экран, мощнейший процессор — всё это в небольшом гаджете. Процессор заслуживает особого внимания. Он обязательно понравится геймерам со стажем.`,
    createdDate: `2021-01-10T13:15:03.411Z`,
    category: [
      `За жизнь`
    ],
    comments: [
      {
        id: `uEP7Ug`,
        text: `Плюсую, но слишком много буквы! Совсем немного...`
      }
    ]
  },
  {
    id: `H6WMzs`,
    title: `Лучшие рок-музыканты 20-века`,
    announce: `Собрать камни бесконечности легко, если вы прирожденный герой. Простые ежедневные упражнения помогут достичь успеха.`,
    fullText: `Этот смартфон — настоящая находка. Большой и яркий экран, мощнейший процессор — всё это в небольшом гаджете. Программировать не настолько сложно, как об этом говорят. Из под его пера вышло 8 платиновых альбомов. Освоить вёрстку несложно. Возьмите книгу новую книгу и закрепите все упражнения на практике. Игры и программирование разные вещи. Не стоит идти в программисты, если вам нравятся только игры. Достичь успеха помогут ежедневные повторения.`,
    createdDate: `2021-01-06T12:39:04.993Z`,
    category: [
      `Железо`,
      `Разное`,
      `Музыка`,
      `IT`,
      `Деревья`,
      `Кино`,
      `Велоспорт`,
      `За жизнь`
    ],
    comments: [
      {
        id: `LEKS_c`,
        text: `Давно не пользуюсь стационарными компьютерами. Ноутбуки победили. Согласен с автором! Это где ж такие красоты?`
      },
      {
        id: `k3LulV`,
        text: `Это где ж такие красоты? Плюсую, но слишком много буквы!`
      },
      {
        id: `lYCerE`,
        text: `Планируете записать видосик на эту тему?`
      }
    ]
  },
  {
    id: `O6b4MY`,
    title: `Что такое золотое сечение`,
    announce: `Это один из лучших рок-музыкантов. Золотое сечение — соотношение двух величин, гармоническая пропорция.`,
    fullText: `Вы можете достичь всего. Стоит только немного постараться и запастись книгами. Программировать не настолько сложно, как об этом говорят. Игры и программирование разные вещи. Не стоит идти в программисты, если вам нравятся только игры. Первая большая ёлка была установлена только в 1938 году. Золотое сечение — соотношение двух величин, гармоническая пропорция. Простые ежедневные упражнения помогут достичь успеха. Как начать действовать? Для начала просто соберитесь. Ёлки — это не просто красивое дерево. Это прочная древесина. Освоить вёрстку несложно. Возьмите книгу новую книгу и закрепите все упражнения на практике.`,
    createdDate: `2020-12-14T15:21:01.111Z`,
    category: [
      `Музыка`,
      `Кино`,
      `Без рамки`,
      `Деревья`,
      `Разное`,
      `За жизнь`,
      `IT`,
      `Путешествия`,
      `Велоспорт`,
      `Железо`
    ],
    comments: [
      {
        id: `J3INqD`,
        text: `Плюсую, но слишком много буквы!`
      },
      {
        id: `jidaGm`,
        text: `Это где ж такие красоты?`
      },
      {
        id: `IuMBOc`,
        text: `Плюсую, но слишком много буквы!`
      }
    ]
  }
];

module.exports.mockPost = {
  title: `Статья про котиков`,
  announce: `Это интересная статья про котиков.`,
  fullText: `Очень подробная и интересная статья про котиков.`,
  createdDate: `2020-12-14T15:21:01.111Z`,
  category: [
    `Котики`,
    `Железо`
  ]
};
